"[12:53, 10/19/2025] אליעזר בן יהודה: טוב, דיברתי עם איזה בחור בשביל קורי לוי,\nיש לו, זה קשה למצוא אותו,\nלא בדיוק יודע, הוא נשמע לי יחסית צעיר, כאילו, מה זה, זה יכול להיות שהוא יותר מבוגר אומני?\nובעל ניסיון, יש לו, היה לו איזה קשר לשלושה סטארט-אפים,\nאחד או שניים מהם שלו, שלו, אני לא בדיוק יודע, והוא החליט לעבור לייעוץ לסטארט-אפיסטים,\nאז אמרתי לו, למה לא היה לי לדבר איתו? הוא היה כאילו זורם, זמין,\nוהוא אפשר לי לקבל ממנו מידע. דיברנו על כלליות אמנם,\nצריך לרדת יותר על הפרטים,\nאבל הוא העלה נתונים מאוד מאוד מעניינים שמראים על איזושהי ידיעה. בואו נגיד להקים\nסטארט-אפ זה לא עניין של מה בכך, אז סתם אשתף אותך בכל מיני דברים, כי כולנו רוצים להיות סטארט-אפיסטים בישראל.\nאז דיברתי איתו, למשל, על ה... יש לי, כאילו, אני אומר ברכאות,\nלא אוהב להגיד סטארט-אפ,\nוזה רעיון לגבי המילי מכס, דברים כאלה, שזה כאילו מה שנקרא הסטארט-אפ הכי גדול שלי,\nשהוא יותר מורכב ויש בו הרבה גורמים.\nאז קודם כול, כל מיני דברים. קודם כול, מה המודל העסקי שאתם שאל?\nהאם זה Business to Government,\nאו האם זה Business to Business,\nמה קהל הכוחות שלי, מה הגודל שלהם, כמה כסף אני יכול לתמחר פר זה? זה מודל שחשבתי.\nעכשיו, זה גם נכנס לקרנות הון-סיטי.\nכאילו,\nשיש פה כל מיני עלויות, ולעשות את זה לבד, כפי שאני מדבר וחשבתי,\nזה יהיה מורכב מאוד עבוד.\nאז זה אומר, בשביל קרנות הון-סיכון אתה צריך כאילו מינימום איזשהו רווח של,\nבואו נגיד, פחות מ-1 מיליון זה גם בסדר בתור התחלה,\nוהם יצטרכו לפקח על זה וזה, בקיצור, יש פה כל מיני מורכבויות.\nעכשיו, אנחנו מדברים לגמרי בעוול.\nבנוסף, הוא אמר שצריך לעשות פה איזשהו מחקר שוק, מי המתחרים, המון, המון, המון.\nיש פה המון מה לעשות.\nלגבי ה-Business to Government, הוא אמר שיש מה שנקרא, מה ה-cycle מכירה.\nזאת אומרת, כל כמה זמן אתה מצפה לתת מכירה, אני מניח, אני לא בדיוק יודע,\nמשהו כזה.\nבנוסף, כיזם, הוא אמר שאחד הדברים זה להביא את המיזם לרמה כזאת שאנשים ירצו להצטרף אליו,\nיותר מאשר לעשות הכול מאפס.\nבנוסף, הוא אמר לבדוק האם השוק צומח, מה גודל השוק,\nהוא אמר כל מיני פרמנטרים בסיסיים, מעל 10% צמיחה,\nיש פה מקום שלקחת את זה לשלב הבא.\nבקיצור, יש כל מיני דברים שם.\nהוא אמר שיש כמה שאלות שאפשר לתמצת מהפלייבוק שלו,\nשל האם לקחת את זה קדימה או הלאה. אני בעצם דיברתי איתו כי רציתי להבין האם אני מבלבל את השכל או לא,\nכי רעיונות יש עד אין-ספור,\nואני לא חושב שזה משהו מיוחד. אז בקיצור,\nבכל זאת אמרתי, למה לא לדבר איתו? חצי שעה, כאילו זה לא יעלה לי כלום,\nאני לוקח את הניסיון שלו, ואני מקבל ממנו פידבק והוא זרם איתי.\nבואו נראה, האם יש מישהו נתן פתרון לבעיה הזאת כבר?\nבואו נראה, הוא דיבר איתי על עוד איזה רעיון שיש לו, לא משנה.\nבקיצור, סתם היה מעניין, אמרתי, אני אשתף אותך גם, כי מבחינתי אתה ואני במסלול דומה, אתה אומנם הרבה יותר פותח ממני, אבל דווקא כלל.\n[13:04, 10/19/2025] אליעזר בן יהודה: היום גם היה לי מלבד השיחה עם קובי לוי, לא קורי לוי, מלבד השיחה איתו הייתה לי גם שיחה עם איזה דווקא מעניין, חבר'ה דתיים, חרדים\nשהם מציעים שירות בוטים ללקוחות שלהם. עכשיו זה נורא מעניין, למה?\nאהבתי מאוד את ה-use case העסקי,\nמכיוון שקודם כל זה מפתיע שאני בכלל בעמדה הזאת שאני יכול לייעץ,\nאבל כנראה שאימפוסטר סינדרום חזק אצלם. בכל מקרה,\nהם ביקשו שסוכנים שכנראה בשטח או משהו כזה,\nיהיה להם איזשהו קונטקסט של השיחה שלהם,\nובמקביל תהיה להם גישה לאיזשהו מאגר מידע כנראה של מוצרים או מה זמין,\nוצריך להיות שם איזשהו דאדה בסדינמי,\nזמין,\nחי,\nשכשהם מתשאלים אותו, עושים איזשהו query,\nאז הם מקבלים את המידע שהם רוצים בהקשר שלהם בלבד,\nתוך שמירה על הקונטקסט. זאת אומרת, אם שאלתי שאלה לפני שבוע,\nאז אפשר להתחשב במידע, זאת אומרת, כל שאילתה נשמרת והתשובה נשמרת,\nויש איזשהו קונטקסט לומד והתמשך כזה,\nשאני נורא מעניין.\nעכשיו, use case נוסף היה שיש איזושהי מישהי שהיא יועצת,\nשכנראה שואלים אותה המון המון המון המון שאלות,\nויש לה את התוכן של הספרים שהיא כנראה רשמה, והיא רשמה שם בסגנון מסוים וכל הדברים האלה, אז הם בעצם ביקשו לעשות שני דברים שם.\nהם ביקשו, איך קוראים לזה?\nהם ביקשו לדעת,\nזאת אומרת, לשלוף מידע מדויק מהתוכן שלו, שהוא ענק,\nוהצעתי לעשות את זה דרך נוטבוק אליהו או משהו כזה, ובנוסף,\nהם רצו לדעת,\nאחרי שיש להם את המידע הזה, איך לענות בוואטסאפ במקומה,\nוזה מגניב, ברור שהם משתמשים בוואטסאפ ביזנס האמיתי,\nאבל זה הגיוני לסקאלת לקוחות כזה ושימוש כזה, יותר עדיף להם,\nוואטסאפ ביזנס,\nוהם אמרו שהם רוצים לענות כמוה, זאת אומרת, עכשיו, נכון לעכשיו הם כרגע דוחפים את הכל בפרום תטא מידע,\nכנראה מזריקים אותו באיזושהי דרך, אני לא בדיוק יודע,\nוהוא ארוך כגלות, וגם התשובה ארוכה, ובקיצור, הוא מתחיל לקבל גם שם טעויות וכל מיני דברים, ואני לא רואה שהם מנהלים את זה בצורה שלדעתי כבר לא אפקטיבית.\nאז נתתי להם את הפתרון עם הרג,\nבוק אלמנטר פרייז וכל הדברים האלה. אז בקיצור,\nדווקא ה-use case מאוד מאוד מעניין,\nוהצעתי להם בנוסף, שאם הם רוצים, אז אפשר או לתת דוגמה של הסגנון שהיא עונה, שתי תשובות, ולקוות שזה יענות, אבל פתרון יותר כאילו קונקרטי, אמיתי,\nושייתן באמת מענה, זה לקחת שיחות שלה עם אנשים שונים, 100, 200, 300, ולהגיד, זה תשובה טובה, זה לא,\nולהתחיל ללמד אותו מה הסגנון של התשובה הנכון,\nולאמן, או לעשות איזשהו fine-tuning לאיזה מודד טקסט.\nנושא מאוד מעניין בפני עצמו, הייתי רוצה לעשות את זה גם, רציתי לעשות את זה עבור עצמי,\nאבל\nהתחום של ה-LLM הכללי הכניס עבודה, דברים מטורפים,\nמאוד מאוד מעניין.\nמפתיע שאני בכלל יכול לעזור, אבל זה,\nאנשים פה לא עומדים בקצב,\nואני עושה את זה במקרה כאילו full-time job, אז זה מדהים, תקשיב.\n[17:04, 10/19/2025] אליעזר בן יהודה: אוקיי, אז היה לי עוד, היום ישבתי עם הפרויקט של בית כנסת, זה רץ ומקפיא.\nהיום התעסקתי ב...\nאמרתי, נתחיל פרש. לפעמים כשאני מתחיל פרש, אז בעיות שהיו מקודם נעלמות,\nואיכול שנתחיל ניו קונטקסטוריות את כל ה... זה.\nאני פחות ממהר היום גם.\nאז זה השפיע, אבל בכל מקרה בינתיים זה מריץ את הפרויקט שבו אני שולף,\nלמרות שאני אומר שזה לא שולף כל כך טוב,\nמבין שהוא יודע את כל העוגים שיש כדי לראות אם יש איזה סרטון ביוטיוב\nשאפשר לשלוף נוסף, אז היסטוריה והיוגרפת, ובנוסף,\nזה סוף סוף שולף לי את הוידאו של הפלייליסטים מלא מלא מלא מפתיע.\nה-GPT סידר כמה דברים, אני לא יודע אם הוא עשה את רוב הגראנט-ורק אבל קלוד בסוף סגר לי את זה, אני רואה כבר עמוד על החינם ומזעזע לי.\nואז פתאום כרגיל כרגיל קפצתי הרעיון להפוך את זה למשהו מקומי שיהיה נגיש, אתה לוחץ ויש לך גישה לפלייליסט ולווידאו,\nואז עם אופציה גם להוריד את זה קומפרסט.\nלא הגדרתי לו עד איזה כותל זה, ואז אמרתי לעצמי למה לא, מכיוון שהייתי ומחליט כל כך הרבה סרטונים,\nאתה מנסה לעשות כאילו איזה searchable כזה עם דאטאבייס\nבאונליין ולאחסן את זה איפשהו.\nכאילו אומנם כל פרויקט קטן נהיה גדול, אבל מעניין.\n[17:04, 10/19/2025] אליעזר בן יהודה: אוקיי, אז היה לי עוד, היום ישבתי עם הפרויקט של בית כנסת, זה רץ ומקפיא.\nהיום התעסקתי ב...\nאמרתי נתחיל פרש, לפעמים כשאני מתחיל פרש, אז בעיות שהיו מקודם נעלמות,\nואיכול שנתחיל ניו קונטקסטורות את כל הזה.\nאני פחות ממהר היום גם.\nאז זה השפיע, אבל בכל מקרה בינתיים זה מריץ את הפרויקט שבו אני שולף,\nלמרות שאני אומר שזה לא שולף כל כך טוב,\nמבין שהוא יודע את כל העוגים שיש כדי לראות אם יש איזה סרטון ביוטיוב\nשאפשר לשלוף נוסף, אז היסטוריה והיוגרפת, ובנוסף זה סוף סוף שולף לי את הוידאו של הפלייליסטים עם מלא מלא מלא מפתיע.\nה-GPT סידר כמה דברים, אני לא יודע אם הוא עשה את רוב הגראנט וורק,\nאבל קלוד בסוף סגר לי את זה, אני רואה כבר מודל החינם ומזעזע לי.\nואז פתאום כרגיל כרגיל קפצתי הרעיון להפוך את זה למשהו מקומי שיהיה נגיש, אתה לוחץ ויש לך גישה לפלייליסט ולווידאו,\nואז עם אופציה גם להוריד את זה קומפרסט.\nלא הגדרתי לו עד איזה כותל זה, ואז אמרתי לעצמי למה לא, מכיוון שהייתי ומחליט כל כך הרבה סרטונים,\nאתה מנסה לעשות כאילו איזה searchable כזה עם דאטאבייס\nבאונליין ולאחסן את זה איפשהו.\nכאילו אומנם כל פרויקט קטן נהיה גדול, אבל מעניין\n"
