"טוב, אז היום התחיל בצורה הבאה.\nאז הייתי בחופש וזה, לא תכננתי לשבת על המחשב, אבל ראיתי שיש לי איזה כמה דברים, אמרתי, אני אטפל בהם.\nאז תוך כדי שאני לוקח את הילד למוקד רפואה, כדי שיבדקו לו את האוזן, יתנו לו בטח אנטיביוטיקה,\nאז פנה אליי מישהו, אמר, אתמול אמנם,\nהאם יש לי איזה דרך בעזרת בינה מלאכותית\nלקחת רחוב\nולהוציא ממנה את השכונה בגוגל מאפס, אז אפשר קפצתי, רגע, זה שכונה, אתה עושה זום אאוט בגוגל מאפס וזה, אז בטח יש API. כי לעשות עכשיו כאילו עם agent או משהו כזה,\nשלושת אלפים כתובות, היה שם ארבעת אלפים למעשה, זה אבסורדי, זה לא יחזיק מים,\nזה מה שהניסיון שלי אומר, זה גם נראה לי לא אפקטיבי ואיטי בטירוף שיש API,\nסביר להניח שיש, אפשר לשאוב את זה, אז עשיתי שאילתה בקלוד,\nומכיוון שזה בעברית ומכיוון שזה בירושלים, שזה היו מגבלות נוספות, אז אמרתי, תקשיב,\nמה שאני רואה גם באינטרנט, אחרי שביקשתי ממנו לוודא, אני רואה שאופן סטריט מאפס אמורים לעשות את זה, אמרתי, יאללה בואו נעשה בדיקה,\nולקחנו איזה שם של רחוב ורצינו לראות מה יוצא בשאילתה.\nאמרתי לו, תן לי את זה באדרס בר שאני אזרוק את זה ונראה מה יוצא, ככה כל API נורמלי עובד.\nרואים כאן איך שהניסיון בדברים הקטנים מתנקז ואתה יכול להגיע לפתרון יותר מהר ולייצר אותו,\nבואו נגיד ככה, כי אם אתה לא מבין מה זה,\nאיך API, איך הוא נראה, או אפילו את הבייסיקס של הבייסיקס, איך הוא עובד, אז אתה מסתבך.\nאז לצורך העניין קיבלתי את כל התשובה שם, אז מכיוון שזה לא פריטיפייד,\nזרקתי את זה בחזרה להקלוד, אמרתי לו, תקשיב, הנה תוצאה מה דעתך, הוא אומר, מצוין, זה עובד, מצאת את זה,\nואז הוא הראה לי, סימן לי, שיש שם סאברב, זה נקרא פרמטר בשם סאברב,\nוזה השכונה, נכנסתי, בדקתי,\nנראה שזה באמת השכונה, אמרתי, יאללה, אני זורם איתו,\nתבנה לי איזשהו סקריט, אמרתי לו, תעביר לי את זה על גוגל קולאב,\nכי רציתי לשתף את החבר שלו, את הגישה, אחרי שעשיתי גוגל קולאב, היה לי כמובן איזה כמה באגים, איזה סינטקס, איזה בולשיט וזה, בלה בלה בלה,\nדווקא לא הסתבכתי כמו שציפיתי, כי בדרך כלל זה מסתבך, הלך, רץ,\nכמו שצריך,\nומה שנקרא, הלכתי פליי שם, אז הוריד את הספריות,\nוהתחיל לרוץ כמו מלך, הייתי קצת בשוק אפילו, מכמה שזה נגיש,\nזה עבד, לא היה 100% שלמות, כי הדאטה לא עבר ניקוי, והיה שמות של רחובות שרשומים עקום,\nאבל ירושלים זה אזור מובחר\nלזהות את השכונות, כי זה אזור מאוד פופולרי, אז זה היה מצוין.\nאז שלחתי לו את האקסל, וזה היה נחמד, אהבתי את זה,\nהיה לי נחמד.\nאז בהמשך פניתי לרב מיכאל אברהם, יש לו אתר ענק עם מלא טקסט, ואני רוצה לעשות לו דבות רג.\nואמרתי לעצמי, זה אחלה ניסיון עבורי, כאילו איך לעשות את זה, מה לעשות את זה, וזה, יש לזה, אנשים באמת לא מבינים את הפוטנציאל בדבר הזה,\nאין להם מושג אם חושבים שזה איזושהי,\nאיזושהי שטות, אבל באמת לא מבינים,\nכאילו,\nמה המשמעויות של זה,\nהיכולת לחלץ את הטקסט הרלוונטי עם LLM, זה משהו מדהים.\nובקיצור,\nאז אחרי כל הדבר הזה,\nאמרו לי, קח גישה ל-admin panel, זה היה יותר קל ממה שחשבתי.\nחשבתי שעתיים-שלוש רק לנסות להוריד את המידע, בסוף\nהייתי צריך להמיר אותו למשהו ברור יותר עם קלוד קוד,\nשהוא יעשה לי את ה-grant work,\nכמו שאומרים,\nואז הגעתי לשם,\nועד שגעתי לשלב שאני בכלל עובד בקלוד קוד, הייתי צריך להוריד את כל המידע, ובשלב זה גם,\nאחרי שמשהו הורדתי מהאתר, אני אפילו לא יודע אם זה הכל.\nהייתי צריך להשתמש באיזה תוסף בשביל להוריד את הכל, להפעיל STO וכל מיני דברים כאלה. שוב, אני סיימת נכנס פה קצת\nכדי לכוון,\nמנסה להוריד כמה שיותר מידע כדי לקבל תמונה מלאה לאתר, ושאני לא מפספס כלום, כי באמת, מה שווה לעשות רק ל-60% מהאתר.\nאם יש לי את כל הלינקים, אז אני בוודאות יכול,\nומשום מה נטיית הלב שלי נוטה לקחת את ה-HTMLים,\nלהוריד, כאילו ממש לינק-לינק, את ה-HTML,\nלחלץ משם את הטקסט כמבנה, הרי לכל HTML יש מבנה, זה פשוט לחלוש על כל ה-HTMLים.\nאתה יודע, זאת אומרת, למשל שאלות,\nיש להם מבנה HTMLים מסוים, שאלות ותשובות,\nולמרות שבאתר, בבקאנד, זה לא ככה, זה שאלה ותשובה בנפרד,\nזה שני קבצים שונים, וזה קטע מעצבן שהיה צריך לעשות להם מרג' באיזושהי צורה,\nוהמאמרים זה היה יותר קל, כי זה התגובות והמאמר עצמו באותו מקום, וזה קל, ואתה רוצה לחלץ את הכל, כי נמצאות שם גם תוכן של הרב בפועל,\nובקיצור, לא היה פשוט.\nאז אני עדיין לא סיימתי עם זה, אבל זה מה שעשיתי היום.\nמה ה-value של זה, ומאן זה יגיע, אני לא יודע.\n"
