"אז עבדתי ביומיים האחרונים, אם אני לא טועה, לא שמתי פוסט.\nהתעסקתי באיזה בניית פורום, הגוגל פורום, אז 5S ביקשו, יש איזה בחור חדש באופקס שעושה עבודה ממש ממש יפה,\nוהוא רצה לשפר דברים, אני כאילו שלחתי לו איזה מייל, קפצתי בוא תיקח את זה עליך,\nהמנהל לא נמצא, זה עובר מחלקה וכולי.\nאז יש פה ממש מעט אנשים כרגע במחלקה שמנהלים את\nכל זה והם עובדים לא יעיל, עכשיו קטע מצחיק שאופקס\nזה התפקיד שלהם לייעל דברים ולשפר,\nיש מה שנקרא שתי שניות שיפור וכולי, אז זה אמור להיות עליהם, בקיצור הוא לקח את זה על עצמו,\nבנינו איזשהו טופס ב-5S ומה שהיה להם מבחן והם ביצעו את המבחן על זה,\nעשינו ברור אם\nצריך לשלוח איזשהו גרף שלוקח זמן לייצר, זאת אומרת יש אקסל ענק\nשמייצר את זה כדי להראות את ההתקדמות של מבחני ה-5S.\nאז אמרתי לו לפני שאנחנו מפתחים עושים זה כאילו כי יש לזה עלות ובזמן שנדרש פה איך האם לדעתך בכלל צריך את זה? דיברתי עם מישהו מה מבנה המלח רצו על זה?\nהוא עשה דיבור עם המנהל קו ייצור, הוא עשה דיבור עם המנהל שלו,\nביררנו עם עוד אנשים במחלקה,\nבקיצור לא צריך, אמרנו נשלח את זה בצורה רבעונית copy-paste כדי לא לבנות משהו,\nבינתיים גרף חוזקות אנחנו נשלח בצורה אוטומטית,\nכל נגיש פשוט אמור להיות קל ופשוט.\nאז בזה התעסקתי, ממש בחור פרואקטיבי, כל הכבוד לו.\nבמקביל, תוך כדי אני ממשיך להריץ את הבדיקות על הפרויקט ניתוח וידאו,\nאני בונה בדיקות לכל הקומפוננטות כדי שנוכל להמשיך בריפרקטורים\nבצורה בטוחה וכל זה וזה לוקח המון זמן כי ככה זה שאתה מתחיל לעבוד בצורה בלאגניסטית בלי תשתית,\nאבל ככה לומדים.\nהיום למשל, אתמול, יותר נכון, סליחה,\nהתעסקתי ב...\nאיך קוראים לזה?\nהתעסקתי בלעזור לחבר, לשים את הדומיין שלו.\nהייתי אמור לקחת חופש, הייתי קצת חולה, אבל התעסקתי בלעזור לשים את הדומיין שלו,\nקצת לדבר על טכנולוגיות AI,\nמה הוא יכול ללמוד, ב-S44,\nדנו לאן לקחת את העסק, כן לקחת את העסק,\nבמה להתמקד, איזה כלים חסר, הוא מרגיש חסר לו כל מיני דברים, הוא אמר, אתה מתעסק בזה יום-יום,\nאתה תוכל להשלים לי את הפערים,\nאני מוכן לשלם לך וכולי, לא רציתי.\nבקיצור, נתתי לו את זה, באמת בנינו אתר יפה,\nיפה יותר,\nיצאנו דומיין ב-BS44,\nחיברנו את המייל שלו, שהוא ישלח מיילים מהמקום הנכון,\nעזרנו ליישר את הסיפור שלו, דיברנו על הצעות איך לעשות את זה, להציג ללקוחות,\nדיברנו על טכנולוגיה שהוא יכול להראות באיזה מקום, בקיצור, כל מיני דברים כאלה,\nוזהו.\nאז זה מה שעשיתי.\n"
